<template>
  <v-container class="fill-in-height">
    <v-row justify="center">
      <v-col cols="12">
        <h1>О проекте</h1>
      </v-col>
      <v-col cols="12">
        <h2>Предисловие</h2>
        <p>
          Привет, друг! Если ты сейчас читаешь это - значит, скорее всего, участники команды сайта выбрали тебя как тестировщика-добровольца для этого сервиса, который в данный момент находится в стадии "Пре-Альфа Тест 2".
          И мы надемся, что ты уделишь немного своего времени на его изучение и в результате оставишь хотя бы пару отзывов и пожеланий.
        </p>
        <p>
          Не смотря на то, что для проекта уже намечен некоторый путь развития, собранные данные в процессе тестирования могут в значительной степени поменять этот план действий.
          По этому, потраченное тобой на этот проект время для нас очень ценно! Заранее спасибо!
        </p>
        <p>Также, прошу тебя, как тестировщика, не публиковать ссылку на этот сайт и не делиться им с третьими лицами без личного разрешения одного из участников команды. Надеюсь на понимание.</p>
      </v-col>

      <v-col cols="12">
        <h2>О чем сайт?</h2>
        <p>Этот сайт представляет собой сервис, где любой желающий может создать свою игру в жанре "Визуальная новелла" в простом конструкторе и опубликовать ее для других пользователей. И в то же время, любой пользователь может играть в новеллы других авторов абсолютно бесплатно!</p>
        <p>
          Все что нужно, что бы начать - просто
          <router-link to="/signin">
            зарегистрироваться
          </router-link>.
        </p>
      </v-col>

      <v-col cols="12">
        <h2>Что сейчас есть на сайте?</h2>
        <p>Так как сайт находится лишь на начальной стадии тестирования, его функционал еще очень базовый. Однако, его уже достаточно для того, чтобы ощутить основную идею сервиса.</p>
        <ul>
          <li>
            На
            <router-link to="/">
              главной странице
            </router-link> можно увидеть список всех опубликованных новелл;
          </li>
          <li>По кнопке <a target="_blank" rel="nofollow noindex" href="https://prnt.sc/137q2vq">"Подробнее"</a> - узнать дополнительную информацию о новелле;</li>
          <li>В новеллу можно <a target="_blank" rel="nofollow noindex" href="https://prnt.sc/137q4gz">поиграть</a>;</li>
          <li>Новеллу можно <a target="_blank" rel="nofollow noindex" href="https://prnt.sc/137q7q9">создать</a>;</li>
          <li>Есть возможность тестировать и публиковать свои игры со страницы <a target="_blank" rel="nofollow noindex" href="https://prnt.sc/137qaff">"Мои новеллы"</a>;</li>
          <li>Можно посмотреть список новелл конкретного автора, кликнув на его псевдоним/аватар.</li>
          <li>Так же, главной особенностью сервиса мы считаем - <a target="_blank" rel="nofollow noindex" href="https://prnt.sc/137qmaj">конструктор персонажей</a></li>
        </ul>
      </v-col>

      <v-col cols="12">
        <h2>Как выглядит игра?</h2>
        <p>
          Игра - это тексто-графическая история, которая состоит из сцен, между которыми игрок перемещается посредством выбора действий(Экшенов).
          Внешне выглядит вот так - <a target="_blank" rel="nofollow noindex" href="https://prnt.sc/137qcj3">скриншот</a>.
        </p>
        <p>На каждой сцене есть:</p>
        <ul>
          <li>Бэкграунд - изображение или однотонный цвет;</li>
          <li>Персонаж - некоторые сцены могут содержать изображение персонажа;</li>
          <li>Основной текст - блок текста, содержащий описание происходящего на сцене. Может быть как прямой речью персонажа, так и произвольным повествованием;</li>
          <li>Действия/ответы - кнопки под основным текстом, нажимая на которые вы определяете дальнейший ход сюжета.</li>
        </ul>
      </v-col>

      <v-col cols="12">
        <h2>И это все?</h2>
        <p>Знающие люди скажут, что имеющийся сейчас в игре функционал - это хорошо, но чего-то не хватает. Как уже было написано выше - сервис находится только во второй стадии тестирования и в будущем будет расширяться. И ты, как тестировщик, можешь повлиять на его судьбу своими отзывами.</p>
        <p>На будущее уже запланировано:</p>
        <ul>
          <li>Добавление музыкального сопровождения;</li>
          <li>Добавление на сцену визуальных эффектов, вроде: встряска экрана, пыль, туман, дождь, блики света и т.п.;</li>
          <li>Расширенная логика переходов к сценам;</li>
          <li>Многое другое по мелочи.</li>
        </ul>
      </v-col>

      <v-col cols="12">
        <h2>Сайт работает на мобильном?</h2>
        <p>Технически - да. Но сложные страницы могут не очень хорошо выглядеть на некоторых мобильных устройствах. По этой причине мы закрыли доступ к конструктору для них. Но играть в новеллы на моб. устройствах не только можно, но и вполне удобно. Это временная мера, которая будет исправлена в будущем. К тому же, после релиза планируется разработка мобильного приложения для сервиса.</p>
      </v-col>

      <v-col cols="12">
        <h2>Как работать с конструктором?</h2>
        <p>Для объяснения этого процесса я записал несколько коротких видео. Их можно посмотреть <a target="_blank" rel="nofollow noindex" href="https://disk.yandex.ua/d/j_j7KZpoVQKFVg">здесь</a>. Но ты можешь попробовать разобраться с конструктором самостоятельно. Мы надеемся, что его интерфейс уже достаточно прост и интуитивно понятен. Возможно, мы еще не до конца достигли этой цели, по этому твой опыт его самостоятельного изучения без подсказок будет для нас очень ценным!</p>
      </v-col>

      <v-col cols="12">
        <h2>Как лучше всего оставить отзыв или сообщить о проблеме?</h2>
        <p>Идеальным вариантом является кнопка с изображением жучка в правом нижнем углу экрана - <a target="_blank" rel="nofollow noindex" href="https://prnt.sc/137qev1">скриншот</a>. Она видна на каждой странице для всех авторизованных пользоватей. По клику на нее появится окно, где можно написать сообщение и отправить. Это сообщение попадет к нам в специальный раздел, где мы его точно увидим и учтем/исправим перед следующим этапом тестирования.</p>
      </v-col>

      <v-col cols="12">
        <h2>Послесловие</h2>
        <p>
          Длинный текст с описанием сервиса закончился. Теперь ничего не мешает просто им воспользоваться. Лучше всего начать с
          <router-link to="/signin">
            регистрации
          </router-link>.
        </p>
      </v-col>
    </v-row>
  </v-container>
</template>

<style lang="sass" scoped>
a
  text-decoration: underline
</style>
