<template>
  <v-container>
    <v-row justify="center">
      <v-col cols="12">
        <h1>О сайте</h1>
      </v-col>
      <v-col cols="12">
        <h2>Предисловие</h2>
        <p>Привет, друг! Если ты сейчас читаешь это - значит, скорее всего, автор сайта (читай, Я) выбрал тебя как тестировщика для сего многообещающего сервиса, который в данный момент находится в стадии "Пре-Альфа Тест". И я надеюсь, что ты уделишь немного своего времени на его изучение и в результате оставишь хотя бы пару отзывов и пожеланий.</p>
        <p>Не смотря на то, что я уже имею некое свое видение касательно дальнейшего развития сайта, собранные данные в процессе тестирования могут в значительной степени поменять мой план действий. По этому, потраченное тобой на этот сайт время для меня очень ценно! Заранее спасибо!</p>
        <p>Также, прошу тебя, как тестировщика, не публиковать ссылку на этот сайт и не делиться им с третьими лицами без моего личного разрешения. Надеюсь на понимание.</p>
      </v-col>

      <v-col cols="12">
        <h2>О чем сайт?</h2>
        <p>Этот сайт представляет собой сервис, где любой желающий может создать свою игру в жанре "Визуальная новелла" в простом конструкторе и опубликовать ее для других пользователей. И в то же время, любой пользователь может играть в новеллы других авторов абсолютно бесплатно!</p>
        <p>
          Все что нужно, что бы начать - просто <router-link to="/signin">
            зарегистрироваться
          </router-link>.
        </p>
      </v-col>

      <v-col cols="12">
        <h2>Что сейчас есть на сайте?</h2>
        <p>Так как сайт находится лишь на начальной стадии тестирования, его функционал еще очень базовый. Однако, его уже достаточно для того, что бы ощутить основную идею сервиса.</p>
        <ul>
          <li>
            На <router-link to="/">
              главной странице
            </router-link> можно увидеть список всех опубликованных новелл;
          </li>
          <li>По кнопке <a target="_blank" href="https://prnt.sc/uscmwx">"Подробнее"</a>, можно узнать дополнительную информацию о новелле;</li>
          <li>В новеллу можно <a target="_blank" href="https://prnt.sc/uscnb4">поиграть</a>;</li>
          <li>Новеллу можно <a target="_blank" href="https://prnt.sc/uscngk">создать</a>;</li>
          <li>Есть возможность тестировать и публиковать свои игры со страницы <a target="_blank" href="https://prnt.sc/uscnwr">"Мои новеллы"</a>.</li>
        </ul>
      </v-col>

      <v-col cols="12">
        <h2>Как выглядит игра?</h2>
        <p>Игра - это тексто-графическая история, которая состоит из сцен, между которыми игрок перемещается посредством выбора действий(Экшенов). Внешне выглядит вот так - <a target="_blank" href="https://prnt.sc/usco8m">скриншот</a>.</p>
        <p>На каждой сцене есть:</p>
        <ul>
          <li>Бэкграунд - изображение или однотонный цвет;</li>
          <li>Заглавный текст - верхний блок текста, содержащий описание происходящего на сцене. Может быть как прямой речью персонажа, так и произвольным повествованием;</li>
          <li>Действия/ответы - кнопки под заглавным текстом, нажимая на которые вы определяете дальнейший ход сюжета;</li>
        </ul>
      </v-col>

      <v-col cols="12">
        <h2>И это все?</h2>
        <p>Знающие люди скажут, что имеющийся сейчас игре функционал - не является полноценной новеллой и я с этим полностью согласен. Как уже было написано выше - сервис находится только в первой стадии тестирования и в будущем будет расширяться. И ты, как тестировщик, можешь повлиять на его судьбу своими отзывами.</p>
        <p>На будущее уже запланировано:</p>
        <ul>
          <li>Добавление персонажей на сцену;</li>
          <li>Конструктор 2D персонажей почти как в Sims;</li>
          <li>Добавление музыкального сопровождения;</li>
          <li>Добавление на сцену визуальных эффектов, вроде: встряска экрана, пыль, туман, дождь, блики света и т.п.;</li>
          <li>Расширенная логика переходов к сценам;</li>
          <li>Многое другое по мелочи.</li>
        </ul>
      </v-col>

      <v-col cols="12">
        <h2>Сайт работает на мобильном?</h2>
        <p>Технически - да. Но сложные страницы могут не очень хорошо выглядеть на некоторых мобильных устройствах. По этой причине я закрыл доступ к конструктору для них. Но играть в новеллы на мобилах уже вполне можно. Это временная мера, которая будет исправлена в будущем. К тому же, после релиза планируется разработка мобильного приложения для сервиса.</p>
      </v-col>

      <v-col cols="12">
        <h2>Как работать с конструктором?</h2>
        <p>Для объяснения этого процесса я записал короткое видео. Его можно посмотреть <a target="_blank" href="https://yadi.sk/d/cOpW1Fe9UOVfuA">здесь</a>. Но ты можешь попробовать разобраться с конструктором самостаятельно. Предполагается, что его интерфейс должен быть прост и интуитивно понятен. Возможно, я не до конца достиг этой цели, по этому твой опыт его самостоятельного изучения без подсказок от автора будет для меня очень ценным!</p>
      </v-col>

      <v-col cols="12">
        <h2>Как лучше всего оставить отзыв или сообщить о проблеме?</h2>
        <p>Идеальным вариантом является кнопка с изображением жучка в правом нижнем углу экрана - <a href="https://prnt.sc/usd0t3" target="_blank">скриншот</a>. Она видна на каждой странице для всех авторизованных пользоватей. По клику на нее появится окно, где можно написать сообщение и отправить. Это сообщение попадет ко мне в специальный раздел для администратора, где я его точно увижу и учту/исправлю/добавлю перед следующим этапом тестирования.</p>
      </v-col>

      <v-col cols="12">
        <h2>Очевидные проблемы</h2>
        <p>В конструторе сейчас можно установить всего 2 типа экшена:</p>
        <ul>
          <li>Переход к выбранной сцене;</li>
          <li>Выход из новеллы, как завершение игрового процесса.</li>
        </ul>
        <p>Я предвижу вопрос каждого тестировщика: "Как мне сделать так, что бы в зависимости от выбора в прошлом, я мог отправить игрока на сцену А или Б?".</p>
        <p>Отвечаю: Сейчас простого функционала для этого нет. Но планируется к следующему этапу тестирования. Все что я пока могу предложить - это создавать дублирующиеся ветки сюжета после "судьбоносного" действия. Если выразился не понятно, а очень интересно как это сделать - прошу задавать вопрос в личку.</p>
      </v-col>

      <v-col cols="12">
        <h2>Послесловие</h2>
        <p>
          Длинный текст с описанием сервиса закончился. Теперь ничего не мешает просто им пользоваться. Лучше всего начать с
          <router-link to="/signin">
            регистрации
          </router-link>.
        </p>
      </v-col>
    </v-row>
  </v-container>
</template>

<style lang="sass" scoped>
a
  text-decoration: underline
</style>
